模拟文件目录系统
问题描述：
使用树结构实现一个简单的文件目录系统的模拟程序
基本要求：
1. 设计并实现目录树 CatalogTree 的 ADT。 
2. 应用以上 CatalogTree 结构设计并实现一文件目录系统的模拟程序。 
3. 文件目录系统程序是一个不断等待用户输入命令的解释程序，根据用户
输入的命令完成相关操作，直到退出（quit）。目录系统应支持如下基本
操作： 
(1) dir ——列出当前目录下的所有子目录与文件项。 
(2) cd ——列出当前目录的绝对路经 。 
(3) cd ..——当前目录变为当前目录的父目录 。 
(4) cd str——当前目录变为 str 所表示路径的目录。 
(5) mkdir str ——在(当前目录下)创建一个子目录(名为 str)，若存在则
不进行任何操作。 
(6) mkfile str ——在(当前目录下)创建一个文件(名为 str) ，若存在则
不进行任何操作。 
(7) delete str ——删除(当前目录下)名为 str 的目录或文件，若不存在
则不进行任何操作。 
(8) save str—— 将从根节点开始的目录树结构保存到文件(名为 str)
中。 
(9) load str —— 从文件 str 中读取之前保存的目录树结构，并根据其
重新建立当前目录树 
(10) quit —— 退出程序 
选做功能 
你可以自行充实目录树支持的指令，添加一些参数支持，这将有助于你对目录
系统的理解。提倡实现其他指令或带参数的现有指令。
